#include <stdio.h>

// a = -3 10000000000000000000000000000011
//        11111111111111111111111111111100
//        11111111111111111111111111111101

// b = -5 10000000000000000000000000000101
//        11111111111111111111111111111010
//        11111111111111111111111111111011

// a = -3 11111111111111111111111111111101
// b = -5 11111111111111111111111111111011
// a | b  00000000000000000000000000000110
// 统计按位或的结果中1的个数

int main()
{
    int a = 22;
    int b = 33;
    int c = a ^ b;

    int count = 0;
    for (int i = 0; i < 32; i++)
    {
        int d = c & 1;
        if (d)
            count++;
        c >>= 1;
    }

    printf("The count of number 1: %d", count);

    return 0;
}

int calc_diff_bit(int m, int n)
{
	int tmp = m^n;
	int count = 0;
	while(tmp)
	{
		tmp = tmp&(tmp-1);
		count++;
	}
	return count;
}